[
  {
    "title": "How important is freedom to enjoyment?",
    "date": "07-06-2023",
    "abstract": "Musings on whether liberty and freedom of choice play a core role in enjoyment of a vacation",
    "content": [
      "Over the course of this my graduation trip, for those who don't know this is a thing common for rich people to do to go to another country on graduating, I have been thinking a lot about the concept of whether procedural or random fun is better. ",
      "Our graduating class did not go in one singular entity, all 110 or so of our year group, to one location, but split into many different groups of 10ish people. One group, which I would like to use as the example for procedural fun, followed a certain wealthy girl to Phuket. It was an all expenses paid trip, bar flight costs, to the Thai Island with all actives planned out and living in a certain bubble (to my understanding). Their time was spent on expensive yachts, going to their table in a equally as expensive clubs, and so on. While I did not go on this trip so I can't say all of this is true but for the sake of the thought experiment lets say they had this kinda of idealistic vacation, but one where ever minute was planned. This trip can be seen as playing into the cultural archetype of what a vacation should be, actualising the scenes of TV show, movies, reels, ads and all other things that make up culture.",
      "Not too far away in Koh Samui, my friends and I have were saying 'they can not be having as much fun as we are' and pointed to the rigidness and artificiality of their supposed enjoyment as the reason. Our activities on the other hand, were not really planned, generally deciding before we left or finding them on driving around on our mopeds (side- quests). The exact entropy of our activities can be debated and should be quantified if I wanted to carry some order of academic vigour in my enquiry, however that would require and investigation into information entropy that I am not prepared to do at this moment writing this on the cold floor of our villa as we are preparing to leave to the airport back home.",
      "The spirit of the question is a question of how big a factor is liberty to enjoyment. For us, with mopeds and money we had ultimate autonomy able to 'amour fati' and let our holiday be guided by serendipity. For them they played almost as actors following a script and preforming the correct action and feeling the right emotion at the designated point in time. Almost turning fun into `fn fun()` instead of emotion that springs upon you. ",
      "While the last paragraph is worded in a way that makes my potion clear, I am not those people I don't know and can never know if they had more or less fun then we had, whatever fun means. I do not live in their souls, I have no data to quantify how the two experiences compare, no control group or even the ability to create an unbiased control group. Ultimately I can never know whether liberty impacted their fun and if it is a core component of fun, however I have an innate feeling that it does. It is possible this is the inner liberal within me, or the repressed christian values of my ancestors providing me with the conviction that me alone, with my actions and decisions make my life fun and not the complex interaction of societies as has been so proved.",
      "It is difficult for me to rational agree with the idea that individual liberty should be valued over the prosperity of the group. Which is now a question I pose to whoever is reading this, how does your cultural background influence your opinion on this question of what is more fluffing procedural or random fun?"
    ]
  },
  {
    "title": "Cultural Terrorist",
    "date": "19-02-2023",
    "abstract": "A fun new term",
    "content": [
      "This is a term I am quite found of, it means (to me) breaking apart culture to it's root components, removing all the abstractions and obfuscations and showing the world for how silly it is. I think I will start identifying with it."
    ]
  },
  {
    "title": "On Software Concussions",
    "date": "07-02-2023",
    "abstract": "musings on the extensions of class consciousness as a concept to wider elimination of consciousness of how the economic base is manipulating consumer psychology in my specific field.",
    "content": [
      "\t Class concussions in its modern form are forgotten by the proletariat. However we have gained other consciousness, such as environmental and race consciousness (and I am sure others that I am not conscious of).",
      "For me as a Socialist and FOSS (free and open source software) advocate, I would like to point out that software consciousness and class consciousness have not come to the public consciousness. Why? Well if we examine the rise of the two forms I stated, they were profitable. Race and environmental consciousness was profitable to advertise, creating new industries that were easy to talk about (good press) without any legitimate change being put into place.",
      "Class and Software, while equally as marketable and ethical, are far less profitable. The reasons for the use of free software and for a progression in economic stages are, at least to me (due to my life experiences), so incredibly evident (I will write on this later). So therefore one must conclude that the power structures of capitalism through the organs of media and language inhibit the laymen from further beneficial consciousness."
    ]
  },
  {
    "title": "How to write about those damn commies?",
    "date": "05-02-2023",
    "abstract": "A pastiche inspired by Binyavanga Wainaina essay 'How to write about africa'",
    "content": [
      "Always use the word 'Communist' or 'Neo-Marxist' in your title, and never isolate a particular school of thought or Marxist work. Other useful words are 'Fasci', 'stalinist' or 'cultural marxist'. The enforced negative connotation will do wonders for you and your friends.",
      "In your text, point out how modern media is corrupted by gender and race equality because of the 'postmodern neo-Marxists' 'language police' . You don't have to understand what those words mean, or the inherent contradictions in the two philosophies, people will automatically resonate with the message once Jordan Peterson retweets it.",
      "When discussing North Korea, ensure to never cite your sources. When referring to the country use the word 'Rogue State', when talking about their prisons refer to them as 'prison camps', when talking about their military use the word 'death squad'. If the topic of nukes becomes viral, don't mention the number of nukes your country has tested and is currently pointing at the 'Rogue State', or that they offered to disband their program in return for peace, focus on the crimes of the failing Stalinist dictatorship and how it threatens your sovereignty.",
      "In connection with this, I recommend not looking into things too deeply. The last thing we would want is the 'ruthless criticism of everything existing'. Problems should be addressed at a surface level. By addressing one tumour at a time, instead of removing the affected organ, your readers will be too distracted to pontificate on radical change. The ideas must only touch on the surface, never grappling with the roots of the issue. The facade of treating the symptoms will keep your readers servile, best not to get their minds thinking too hard then they might become conscious. Hegel, Marx, Lenin, Mao, Guevara Luxembourg, and Adorno are dead men whose methods don’t apply to you in the modern day.",
      "If ever necessary to use Marx's definition of communism: ' Abolition of private property' (communist manifesto), do not refer to the line before, reaffirm the belief the 'communists want to take your stuff', as the Marxist political theory surrounding property is oh so trivial. Don’t mention stage theory or any other conclusions of material analysis, for we all their analysis is much too simple but don’t mention why.",
      "When addressing Marxist criticism of society make sure to say, we do not live in real capitalism, good words are 'crony capitalism' or 'corporatism'. Your readers know the state of the world is due to too much state intervention and not the natural course of capitalism. If only our hero Regan could return.",
      "When discussing socialist countries, always point to the flaws of these countries, and shy away from introspection. Do reflect on whether your own country suffers from the same ailments or is possibly the cause of theirs. Ensure to repeat the dogma that 'socialism killed 100s of million' (The Black Book Of Communism), and remind your readers of the failures of Venezuela, Cuba, The USSR, Vietnam, North Korea, Nepal, Nicaragua, Algeria… History clearly shows that those are all a result of communism, the idiosyncrasies of politics, economics and history are far too complex for your reader. Modern Marxists like Perenti and Žižek are to be ignored. Their work is only filled with jargon and contradictions, what your readers want is an answer, not more questions.",
      "I would not recommend you readers read, Why Socialism by Einstein, The principles of communism by Engels as a start.",
      "Repudiation and ignorance are your keys to unlocking your reader's piggy bank. Without this manipulation of language and reality, yours and your benefactors' business will fall out of favour; your weekly trip to the Bahamas could be disrupted. Without your penmanship, the hedonic treadmill would stop running and we would have to face reality and see the pain and suffering of which our desires sponsor. So open a new Word document, and find some obscure satire or revisionist historian; your profit and readers await."
    ]
  }
]