[
  {
    "title": "On Class and Software Concussions",
    "date": "7th Feb, 2023",
    "abstract": "musings on the extensions of class consciousness as a concept to wider elimination of consciousness of how the economic base is manipulating consumer psychology in my specific field.",
    "content": [
      "Class concussions in its modern form are forgotten by the proletariat. However we have gained other consciousness, such as environmental and race consciousness (and I am sure others that I am not conscious of).",
      "For me as a Socialist and FOSS (free and open source software) advocate, I would like to point out that software consciousness and class consciousness have not come to the public consciousness. Why? Well if we examine the rise of the two forms I stated, they were profitable. Race and environmental consciousness was profitable to advertise, creating new industries that were easy to talk about (good press) without any legitimate change being put into place.",
      "Class and Software, while equally as marketable and ethical, are far less profitable. The reasons for the use of free software and for a progression in economic stages are, at least to me (due to my life experiences), so incredibly evident (I will write on this later). So therefore one must conclude that the power structures of capitalism through the organs of media and language inhibit the laymen from further beneficial consciousness."
    ]
  },
  {
    "title": "How to write about those damn commies?",
    "date": "5th Feb, 2023",
    "abstract": "An pastiche inspired by Binyavanga Wainaina essay 'How to write about africa' from a communist perspective.",
    "content": [
      "Always use the word 'Communist' or 'Neo-Marxist' in your title, and never isolate a particular school of thought or Marxist work. Other useful words are 'Fasci', 'stalinist' or 'cultural marxist'. The enforced negative connotation will do wonders for you and your friends.",
      "In your text, point out how modern media is corrupted by gender and race equality because of the 'postmodern neo-Marxists' 'language police' . You don't have to understand what those words mean, or the inherent contradictions in the two philosophies, people will automatically resonate with the message once Jordan Peterson retweets it.",
      "When discussing North Korea, ensure to never cite your sources. When referring to the country use the word 'Rogue State', when talking about their prisons refer to them as 'prison camps', when talking about their military use the word 'death squad'. If the topic of nukes becomes viral, don't mention the number of nukes your country has tested and is currently pointing at the 'Rogue State', or that they offered to disband their program in return for peace, focus on the crimes of the failing Stalinist dictatorship and how it threatens your sovereignty.",
      "In connection with this, I recommend not looking into things too deeply. The last thing we would want is the 'ruthless criticism of everything existing'. Problems should be addressed at a surface level. By addressing one tumour at a time, instead of removing the affected organ, your readers will be too distracted to pontificate on radical change. The ideas must only touch on the surface, never grappling with the roots of the issue. The facade of treating the symptoms will keep your readers servile, best not to get their minds thinking too hard then they might become conscious. Hegel, Marx, Lenin, Mao, Guevara Luxembourg, and Adorno are dead men whose methods don’t apply to you in the modern day.",
      "If ever necessary to use Marx's definition of communism: ' Abolition of private property' (communist manifesto), do not refer to the line before, reaffirm the belief the 'communists want to take your stuff', as the Marxist political theory surrounding property is oh so trivial. Don’t mention stage theory or any other conclusions of material analysis, for we all their analysis is much too simple but don’t mention why.",
      "When addressing Marxist criticism of society make sure to say, we do not live in real capitalism, good words are 'crony capitalism' or 'corporatism'. Your readers know the state of the world is due to too much state intervention and not the natural course of capitalism. If only our hero Regan could return.",
      "When discussing socialist countries, always point to the flaws of these countries, and shy away from introspection. Do reflect on whether your own country suffers from the same ailments or is possibly the cause of theirs. Ensure to repeat the dogma that 'socialism killed 100s of million' (The Black Book Of Communism), and remind your readers of the failures of Venezuela, Cuba, The USSR, Vietnam, North Korea, Nepal, Nicaragua, Algeria… History clearly shows that those are all a result of communism, the idiosyncrasies of politics, economics and history are far too complex for your reader. Modern Marxists like Perenti and Žižek are to be ignored. Their work is only filled with jargon and contradictions, what your readers want is an answer, not more questions.",
      "I would not recommend you readers read, Why Socialism by Einstein, The principles of communism by Engels as a start.",
      "Repudiation and ignorance are your keys to unlocking your reader's piggy bank. Without this manipulation of language and reality, yours and your benefactors' business will fall out of favour; your weekly trip to the Bahamas could be disrupted. Without your penmanship, the hedonic treadmill would stop running and we would have to face reality and see the pain and suffering of which our desires sponsor. So open a new Word document, and find some obscure satire or revisionist historian; your profit and readers await."
    ]
  }
]
