[
  {
    "idea": "Political analysis of CBT, why is the philosophical foundation of CBT. What is it doing to individuals as political agents. A think enforcing the acceptance or moral relativism and create servility (weakness) need proof.",
    "date": "Feb 7th 2025"
  },
  {
    "idea": "Look at Idols of the Mind by Francis Bacon to form an objective scientific method (meditative epistemology).",
    "date": "Jan 29th, 2025"
  },
  {
    "idea": "Revaluate Margaret Little's argument against cosmetic surgery.",
    "date": "Oct 1st, 2024"
  },
  {
    "idea": "Dante's inferno but using the planets as rings of hell. A little prince journey for the examination of sin. This is a fiction book.",
    "date": "Aug 11th, 2024"
  },
  {
    "idea": "Do facts have a life span?",
    "date": "Aug 5th, 2024"
  },
  {
    "idea": "Does privacy matter?",
    "date": "July 25th, 2024"
  },

  {
    "idea": "Is hedonism the ethic for productivity or success in a finical sense?",
    "date": "July 11th, 2024"
  },
  {
    "idea": "Using Ikagi (the book) and neuroscience to demonstrate that change is a good thing.",
    "date": "July 22th, 2024"
  },
  {
    "idea": "Procedural memory and trauma, or just what memory store (part of the brain) is trauma encoded in?",
    "date": "June 3rd, 2024"
  },
  {
    "idea": "Breaking bad - a negative view on ethics and breaking apart every bad. Idk it's a cool name.",
    "date": "May 8th, 2024"
  },
  {
    "idea": "How do we fix lethargy in consumer decisions making? Or how do we make a marketing campaign against apathy?",
    "date": "May 11th, 2024"
  },
  {
    "idea": "Can we deduce a hierarchy of ethics from the trolley problems, and it's variation?",
    "date": "May 5th, 2024"
  },
  {
    "idea": "Is owning physical media (movies, books, etc) the primary fight against the monopolisation of media by big Netflix, HBO, Disney etc. Something in line with the power of Jellyfish.",
    "date": "March 11th, 2024"
  },
  {
    "idea": "Critical analysis of nursery rhymes as moral artefacts, like how Homer was used in the dialectic of enlightenment.",
    "date": "March 3rd, 2024"
  },
  {
    "idea": "How do we grow as people without self commodification (Marxist sense) I think this was after reading the Early Manuscripts or Marx",
    "date": "March 28th, 2023"
  },
  {
    "idea": "Postmodernist critique on Liberalism (Mill and Lock), so like looking at how art, architecture, governing bodies etc changed after them.",
    "date": "March 17th, 2023"
  },
  {
    "idea": "At what number does wealth become immoral",
    "date": "March 10th, 2023"
  },
  {
    "idea": "Construct a proof against 'On Being Lazy', I kinda did in my god or nature is unproductive but a more holistic proof against laziness as a fight against capital.",
    "date": "March 3rd, 2023"
  },
  {
    "idea": "Is masculinity, meaning assertive and otherwise traditionally masculine attributes (in a Western Context) necessary to flourish under capitalism. To put it another way beyond Marx's one page mentioning that the 'second sex' is the original exploited class for the culture created to suppress them into the labour of child bearing, does modern neoliberal capitalism enforce the same same sexist ethic?",
    "date": "July 7th 2023"
  },
  {
    "idea": "Write up a utilitarian argument against closed source software, as well as a deontological argument. I have been thinking about this for years now and probably have the tools to, but have not gotten around to it because every argument ends up being a critique of private property. It is possible that I can avoid critical theory (it is not a very popular thesis as it is quite sad) if I just focus on ancient and modern philosophy, no time tho",
    "date": "Jan 1st 2020"
  }
]