[
  {
    "name": "Ibn Sina",
    "text": "I prefer a short life with width to a narrow one with length."
  },
  {
    "name": "Oscar Wilde, Picture of Dorian Gray",
    "text": "Beauty is a form of Genius--is higher, indeed, than Genius, as it needs no explanation. It is one of the great facts of the world, like sunlight, or springtime, or the reflection in the dark waters of that silver shell we call the moon. It cannot be questioned. It has divine right of sovereignty. "
  },
  {
    "name": "Socrates/Elanor Roosevelt",
    "text": "Strong minds discuss ideas, average minds discuss events, weak minds discuss people."
  },
  {
    "name": "Davina Chan, CogSci Lecture at UC Berkeley",
    "text": "A belief is just a thought you have over and over again"
  },
  {
    "name": "Albert Camus, The Stranger",
    "text": "Fiction is the lie through which we tell the truth."
  },
  {
    "name": "Fyodor Dostoevsky, White Nights",
    "text": "But how could you live and have no story to tell?"
  },
  {
    "name": "Karl Marx, A Contribution to the Critique of Hegel’s Philosophy of Righ",
    "text": "To be radical is to grasp the root of the matter. But, for man, the root is man himself."
  },
  {
    "name": "Viktor E. Frankl, Man's Search for Meaning",
    "text": "No instinct tells him what he has to do, and no tradition tells him what he ought to do; sometimes he does not even know what he wishes to do. Instead, he either wishes to do what other people do (conformism) or he does what other people wish him to do (totalitarianism)."
  },
  {
    "name": "Edith Wharton, Age of Innocence",
    "text": "when she enquired how he meant to spend his afternoon, he had answered paradoxically: 'Oh, I think for a change I'll just save it instead of spending it'"
  },
  {
    "name": "Harper Lee, To Kill A Mockingbird",
    "text": "Delete the adjectives and you'll have the facts"
  },
  {
    "name": "Frankenstein, Mary Shelley",
    "text": "What do you mean? What do you demand of your captain? Are you, then, so easily turned from your design? Did you not call this a glorious expedition? “And wherefore was it glorious? Not because the way was smooth and placid as a southern sea, but because it was full of dangers and terror, because at every new incident your fortitude was to be called forth and your courage exhibited, because danger and death surrounded it, and these you were to brave and overcome. For this was it a glorious, for this was it an honourable undertaking. You were hereafter to be hailed as the benefactors of your species, your names adored as belonging to brave men who encountered death for honour and the benefit of mankind. And now, behold, with the first imagination of danger, or, if you will, the first mighty and terrific trial of your courage, you shrink away and are content to be handed down as men who had not strength enough to endure cold and peril; and so, poor souls, they were chilly and returned to their warm firesides. Why, that requires not this preparation; ye need not have come thus far and dragged your captain to the shame of a defeat merely to prove yourselves cowards. Oh! Be men, or be more than men. Be steady to your purposes and firm as a rock. This ice is not made of such stuff as your hearts may be; it is mutable and cannot withstand you if you say that it shall not. Do not return to your families with the stigma of disgrace marked on your brows. Return as heroes who have fought and conquered and who know not what it is to turn their backs on the foe."
  },
  {
    "name": "Plato, The Republic",
    "text": "The penalties for refusing to participate in politics is that you end up being governed by your inferiors "
  },
  {
    "name": "John Steinbeck, East of Eden",
    "text": "...this was the gold from our mining: 'Thou mayest.' The American Standard translation orders men to triumph over sin (and you can call sin ignorance). The King James translation makes a promise in 'Thou shalt,' meaning that men will surely triumph over sin. But the Hebrew word timshel—'Thou mayest'—that gives a choice. For if 'Thou mayest'—it is also true that 'Thou mayest not.' That makes a man great and that gives him stature with the gods, for in his weakness and his filth and his murder of his brother he has still the great choice. He can choose his course and fight it through and win."
  },
  {
    "name": "Benedict Cumberbatch, Sherlock (TV Show)",
    "text": "Taking your own life, taking it from who, once it's over it's not you who'll miss it. Your own death is something that happens to everyone else, your life is not your own keep your hands off it."
  },
  {
    "name": "Jean Racine",
    "text": "Life is a comedy to those who think, a tragedy to those who feel."
  },
  {
    "name": "Rene Descartes, Discourse on Method",
    "text": "No worries or passions to trouble me."
  },

  {
    "name": "郝景芳, 北京摺疊",
    "text": "寧為玉碎 不為瓦全—寧願為正義的事情犧牲，也不要低聲下氣的活著"
  },
  {
    "name": "Plato, The Republic",
    "text": "Knowledge is of what is, ignorance of what is not, and opinion is intermediate between the two."
  }
]
